## **Exploratory Data Analysis** - **sales data exploration**
### *Part 1*

### Set up imports for access to Pandas, Matplotlib, and My SQL Connector Python libraries

In [1]:
import pandas as pd
import matplotlib as plt
import mysql.connector as connection

### Connect to my remote data source

In [2]:
sales_db = connection.connect(host="devcodecamp-mysql.c5p7yvjq1h8y.us-east-2.rds.amazonaws.com", database="salesdb", user="root", password="D3v$tudent", use_pure=True)

### Query my database to JOIN the information from the sales and cities tables together, and save the result as a single DataFrame variable

In [3]:
joinquery = """SELECT sales.Invoice_ID,
    sales.Customer_Type,
    sales.Product_Line,
    sales.Unit_Price,
    sales.Quantity,
    sales.Total,
    sales.Gross_Income,
    sales.Rating,
    cities.City
    FROM sales
    JOIN cities
    ON sales.City_ID = cities.City_ID
    """
joined_sales_df = pd.read_sql(joinquery,sales_db)
joined_sales_df.head()

C:\Users\16306\AppData\Local\Temp\ipykernel_7188\3162691381.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  joined_sales_df = pd.read_sql(joinquery,sales_db)

,Invoice_ID,Customer_Type,Product_Line,Unit_Price,Quantity,Total,Gross_Income,Rating,City
0,101-17-6199,Normal,Food and beverages,45.79,7,336.5565,16.0265,7.0,Seattle
1,101-81-4070,Member,Health and beauty,62.82,2,131.9220,6.2820,4.9,Milwaukee
2,102-06-2002,Member,Sports and travel,25.25,5,132.5625,6.3125,6.1,Milwaukee
3,102-77-2261,Member,Health and beauty,65.31,7,480.0285,22.8585,4.2,Milwaukee
4,105-10-6182,Member,Fashion accessories,21.48,2,45.1080,2.1480,6.6,Seattle

### Data cleaning and wrangling steps for my DataFrame:
- Exploring the information of the joined DataFrame
- Checking for and removing null values, if necessary
- Checking for and removing duplicate rows, if necessary
- Converting any necessary columns to Pandas DateTime format

In [ ]:
#remove nulls

In [ ]:
#remove dupes

In [ ]:
#convert datetime

### Explore my DataFrame to examine the spread of values across categories.  I will utilize this exploration to answer the following questions:
- How many sales were made for members vs. normal customers?
- How many sales were made at each store location?
- How many sales were made for each product line?
- What is the overall average rating, based on all sales records?

Exploration Question 1 - How many sales were made for members vs. normal customers?

In [ ]:
#exploration1- How many sales were made for members vs. normal customers?

In [ ]:
#viz1- How many sales were made for members vs. normal customers?

Exploration Question 2 - How many sales were made at each store location?

In [ ]:
#exploration2- How many sales were made at each store location?

In [ ]:
#viz2- How many sales were made at each store location?

Exploration Question 3 - How many sales were made for each product line?

In [ ]:
#exploration3- How many sales were made for each product line?

In [ ]:
#viz3- How many sales were made for each product line?

Exploration Question 4 - What is the overall average rating, based on all sales records?

In [ ]:
#exploration4